; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph1 - mode
	image0 - mode
	infrared2 - mode
	GroundStation2 - direction
	Star4 - direction
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Phenomenon5)
	(have_image Phenomenon5 image0)
	(have_image Star6 infrared2)
	(have_image Planet7 infrared2)
	(have_image Planet8 thermograph1)
))

)

; plan
1. (turn_to satellite2 star0 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star0)
   goals met: 0 of 6
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 6
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 6
4. (turn_to satellite2 planet8 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet8)
   goals met: 0 of 6
5. (turn_to satellite1 star1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
6. (turn_to satellite0 star1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star1)
   goals met: 1 of 6
7. (take_image satellite2 planet8 instrument4 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 2 of 6
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 6
9. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 2 of 6
10. (turn_to satellite1 planet7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet7)
   goals met: 2 of 6
11. (take_image satellite1 planet7 instrument3 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 3 of 6
12. (turn_to satellite1 star6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star6)
   goals met: 3 of 6
13. (take_image satellite1 star6 instrument3 infrared2)
   added: (have_image star6 infrared2)
   goals met: 4 of 6
14. (turn_to satellite1 phenomenon5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 6
15. (take_image satellite1 phenomenon5 instrument3 image0)
   added: (have_image phenomenon5 image0)
   goals met: 6 of 6
